Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་ཁྱོད་ལ་མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་ཞེས་བྱ་བ་སེམས་ཀྱི་ཚོར་བ་སྒྲུབ་པ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡང་དག་པར་འདུ་བ། བདུད་བཞི་འདུལ་བར་བྱེད་པ་སྒྲུབ་པ། དཀོན་མཆོག་གསུམ་གྱི་གདུང་གི་གགས་མེད་པར་སྒྲུབ་པ། ཀླུའི་ཡུལ་ཐམས་ཅད་རྣམ་པར་འཇིག་པར་བྱེད་པའི་འོད་ཟེར་སྒྲུབ་པ། སེམས་ཅན་རྣམས་ཀྱི་ལས་ཐམས་ཅད་ཟད་པར་འགྱུར་བ་སྒྲུབ་པ། བྱམས་པ་ཆེན་པོ་དང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་སྒྲུབ་པ། སྙིང་རྗེ་ཆེན་པོ་དང་བསམས་བཞིན་དུ་ངན་འགྲོར་སྐྱེ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྐྱོབ་པ་སྒྲུབ་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཡང་དག་པར་དགའ་བར་བྱེད་པ་སྒྲུབ་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལམ་ངན་པ་དང་། ལྟ་བ་ངན་པ་དང་། འདོད་པ་ངན་པ་དང་། སྨོན་ལམ་ངན་པ་དང་། ཐེག་པ་ངན་པ་ཕྱིར་ལྡོག་པར་བྱེད་པ་སྒྲུབ་པ། སེམས་ཅན་ཐམས་ཅད་ངན་འགྲོ་ལས་ངེས་པར་རྣམ་པར་ཐར་བར་བྱེད་པ་སྒྲུབ་པ། བུད་མེད་ཐམས་ཅད་ཡོངས་སུ་ཐར་བར་བྱེད་ཅིང་སེམས་ཅན་སྐྱེས་བུ་འཐོབ་པ་སྒྲུབ་པ། ཆོས་ཀྱི་ཕུང་པོ་ཐམས་ཅད་ཟད་མི་ཤེས་པ་སྒྲུབ་པ། སེར་སྣ་ཐམས་ཅད་སེལ་བར་བྱེད་པ་སྒྲུབ་པ། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་མངོན་པར་ཤེས་པ་ཐམས་ཅད་མི་ཟད་པ་སྒྲུབ་པ། སེམས་ཅན་ཐམས་ཅད་དད་པར་བྱེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་ལ་གཞོག་པར་བྱེད་པ་སྒྲུབ་པ། ཉན་ཐོས་དང་རྐྱེན་གྱི་ཐེག་པ་སྒྱུར་བ་སྒྲུབ་པ་ཞེས་བྱ་བ་ནས། བླ་ན་མེད་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བར་སྒྲུབ་པ་འདི་ནི་མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཡིན་ཏེ།
en: “Noble son, I will now reveal to you the teaching of the inexhaustible core. It fulfills all wishes, it attracts omniscient wisdom, it subjugates the four māras, it eliminates all obstructions to the lineage of the Three Jewels, it produces the light rays that destroy the entire domain of the nāgas, it exhausts all karmic actions of sentient beings, it produces great love, it brings sentient beings to maturity, it lets one take rebirth in the lower realms intentionally and with great compassion, it protects sentient beings, it pleases the minds of all beings, it reverses all wrong paths, views, desires, aspirations, and vehicles of all beings, it liberates all beings from the lower realms, it liberates all women and causes them to obtain male bodies, it causes all sections of the Dharma to become inexhaustible, it eliminates all miserliness, it causes all types of absorption and higher perceptions to become inexhaustible, it generates faith in all beings, it establishes them on the path of the bodhisattvas, it transforms the vehicle of the hearers and the vehicle of conditions, [. . .] and it accomplishes unsurpassed parinirvāṇa. Such is the teaching of the inexhaustible core.

source: སེམས་ཅན་རྣམས་ཐོས་པ་ཙམ་གྱི་མོད་ལ་ལས་ཀྱི་སྒྲིབ་པ་དང་། སེམས་ཅན་གྱི་སྒྲིབ་པ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱི་བགེགས་བྱེད་པ། འཕངས་པ། ཡོངས་སུ་མ་སྤྱད་པ། མ་ཟད་པ། མ་སྦྱངས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མའི་ཚད་སྙེད་ཀྱང་མ་ལུས་པར་ཟད་པར་འགྱུར་ཏེ།
en: Merely by hearing it, all the karmic obscurations of sentient beings, as well as all their other obscurations—as numerous as the grains of sand in the Ganges—that cause them to block, discard, and disregard all roots of virtue and prevent their fulfillment and practice, will be immediately exhausted.

source: འབྲས་བུ་འགྲུབ་པར་མི་འགྱུར་རོ། །མཚམས་མེད་པའི་ལས་རྣམས་དང་། དམ་པའི་ཆོས་སྤོང་བའི་ལས་རྣམས་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པའི་ལས་རྣམས་ནི་མ་གཏོགས་སོ།
en: The fruition of these obscurations will not manifest, except for that of the karmic actions generated by the acts of immediate retribution, the rejection of the sacred Dharma, and the denigration of noble beings.

source: །རིགས་ཀྱི་བུ་གང་ལ་ལ་མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་ཞེས་བྱ་བ་འདི་ལན་ཅིག་ཙམ་སེམས་རྩེ་གཅིག་པས་ཉན་པར་བྱེད་ན་དེ་ལ་དགའ་བ་དང་། དད་པ་དང་། ཉེ་བར་རྟོག་པ་ཀུན་ཏུ་སྐྱེད་པར་བྱེད་དོ།
en: “Noble son, joy, faith, and understanding will develop in those who listen one-pointedly to this teaching of the inexhaustible core even a single time.

source: །དེའི་ལས་ཀྱི་སྒྲིབ་པ་དང་། སེམས་ཅན་གྱི་སྒྲིབ་པ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱི་བགེགས་བྱེད་པ། འཕངས་པ། ཡོངས་སུ་མ་སྤྱད་པ། མ་ཟད་པ། མ་སྦྱངས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱང་མ་ལུས་པར་ཟད་པར་འགྱུར་རོ་ཞེས་བྱ་བ་ནས་འབྲས་བུ་འགྲུབ་པར་མི་འགྱུར་བའི་བར་དུ་འགྱུར་རོ།
en: All the karmic obscurations of those sentient beings, as well as all their other obscurations—as numerous as the grains of sand in the Ganges—that cause them to block, discard, and disregard all roots of virtue and prevent their fulfillment and practice, will be immediately exhausted. The fruition of these obscurations will not manifest.

source: །དེ་དགེ་བའི་རྩ་བ་ཇི་ལྟ་བུ་ཀུན་ཏུ་སྤྱོད་ཀྱང་རུང་། གལ་ཏེ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཀུན་ཏུ་རྩོམ་པར་བྱེད་ན་ཡང་དེ་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་དང་། རྐྱེན་གྱི་རྒྱལ་བ་དང་། དགྲ་བཅོམ་པ་ཐམས་ཅད་ཀྱིས་ཀྱང་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ།
en: No matter how they engage in the roots of virtue, if they undertake the practice of the perfection of generosity, they will be blessed by all buddhas, by all bodhisattvas, by all circumstantial victors, and by all worthy ones.

source: །དེའི་ཁྱིམ་ལོངས་སྤྱོད་ཟད་མི་ཤེས་པར་ཡང་འགྱུར་རོ།
en: Their households will experience inexhaustible enjoyments.

source: །ལུས་དང་། ངག་དང་། ཡིད་སེར་སྣའི་དྲི་མ་དང་བྲལ་བས་སྣོད་ཡིན་ཞིང་། སྣོད་དུ་གྱུར་པའི་སྦྱིན་གནས་ལ་བརྙས་པ་མེད་པའི་སེམས་ཀྱིས་མི་དམིགས་པའི་ཚུལ་གྱིས་སྦྱིན་པ་བྱིན་པར་བྱེད་ན། ཐ་ན་ཡན་ལག་གི་དམ་པ་མགོ་ཡོངས་སུ་གཏོང་བར་བྱེད་ན་ཡང་དེ་ལ་ལྷ་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་སུས་ཀྱང་བར་ཆད་བྱ་བར་མི་ནུས་ཏེ། མཚམས་མེད་པ་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་དང་། དམ་པའི་ཆོས་སྤོང་བར་བྱེད་པ་ནི་མ་གཏོགས་སོ།
en: If they are themselves proper vessels with body, speech, and mind undefiled by miserliness, and if they practice generosity without apprehension and with minds free of contempt for the recipients of generosity, even if they give away their head—their most sacred limb, no one in the world with its gods and humans will be able to create obstacles for them, unless they have committed the acts of immediate retribution, rejected the sacred Dharma, or denigrated noble beings.

source: །གལ་ཏེ་ཡང་དེ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱེད་པ་ན་དེ་འདི་ལྟ་བུ་རྩོམ་པར་བྱེད་དེ། འཕགས་པ་དགྱེས་པ་དང་། འཕགས་པས་བྱིན་གྱིས་བརླབས་པ་དང་། རྣམ་པར་དག་པའི་ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། ངེས་པ་ལ་གནས་པར་བྱེད་ན་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་ཀྱིས་དད་པར་བྱ་བའི་འོས་སུ་གྱུར་པ་དང་། ཕྱག་བྱ་བའི་འོས་སུ་གྱུར་པ་དང་། རྒྱལ་རིགས་དང་། བྲམ་ཟེ་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱ་བའི་འོས་སུ་གྱུར་པ་ཡིན།
en: “If they are diligent in undertaking the practice of the perfection of discipline, if they please the noble beings and receive their blessings, and if they abide by pure discipline, patience, and certainty, they will be worthy to be trusted and revered by Śakra, Brahmā, and all the protectors of the world. They will also be worthy to be revered by all the members of the kṣatriya class, the brāhmaṇas, the vaiśyas, and the śūdras.

source: གཞན་ལ་མི་སྨོད་པ་ཡིན། བདག་ལ་མི་སྟོད་པ་ཡིན་ཞིང་རྙེད་པ་དང་བཀུར་སྟི་ལ་ལྷག་པར་ཆགས་པ་མེད་པས་ཉིན་མཚན་འདས་པར་བྱེད་དོ།
en: They will spend their days and nights without criticizing others or praising themselves and without clinging to personal gains and honor.

source: །བདེ་བར་གཉིད་ཀྱིས་ལོག་པ་དང་། བདེ་བར་སད་པར་འགྱུར་རོ། །གནོད་པ་ཆུང་བ་དང་། བཟའ་བ་དང་། བཏུང་བ་མོད་ཅིང་མང་བ་དང་། སྙིང་རྗེ་ལ་གནས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་འདོད་པ་དང་། རྩོལ་བ་དོན་ཡོད་པར་འགྱུར་རོ།
en: They will sleep well, wake up refreshed, and experience few discomforts, and food and beverages will be available for them immediately and in great quantity. They will be compassionate and altruistic toward all beings and will exert themselves in meaningful endeavors.

source: །ཕྱི་མའི་དུས་ན་འཆི་བའི་ཚེ་ཕྱོགས་བཅུ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་མཐོང་བར་འགྱུར་ཞིང་དེ་དག་ཀྱང་དེ་ལ་སྐྱེས་བུ་དམ་པ་ལེགས་སོ་ལེགས་སོ།
en: Later, when they die, in the ten directions they will see blessed buddhas who will give them this advice: ‘Excellent, sublime being, excellent!

source: །ཁྱོད་ཚུལ་ཁྲིམས་སྐྱོན་མེད་པ་ཡིན་གྱིས་ངེད་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དག་ཏུ་ཚུར་ཤོག །དེར་ངེད་ཀྱིས་ཁྱོད་ས་བཅུ་ལ་རྣམ་པར་གཞག་པར་བྱའོ་ཞེས་ལུང་སྟོན་པར་འགྱུར་རོ། །དེ་སངས་རྒྱས་མཐོང་བའི་རྒྱུས་འཕགས་པའི་དགའ་བ་དང་། དད་པ་སྐྱེ་བར་འགྱུར་རོ།
en: Your discipline is faultless, so please come here to my pure realm! I will establish you on the ten levels.’ Due to their vision of the buddhas, noble joy and faith will arise in them.

source: །དེ་འཆི་བའི་དུས་བྱས་ནས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་སྟོང་པ་མ་ཡིན་པ་དག་ཏུ་སྐྱེ་བར་འགྱུར་རོ། །དེ་དེར་ཡང་མྱུར་དུ་ས་བཅུ་འཐོབ་པར་འགྱུར་རོ།
en: After they die, they will be born into pure buddha realms where buddhas are present, and there they will quickly reach the ten levels.

source: །དེ་ས་བཅུ་ལ་གནས་ནས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Once they abide on the ten levels, they will then swiftly awaken to unsurpassed and perfect buddhahood.

source: །སྐྱེས་བུ་དེ་མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་འདི་ཐོས་པ་ཙམ་གྱི་མོད་ལ་དེ་གལ་ཏེ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གོམས་པར་བྱེད་ན་དེ་འདི་ལྟ་སྟེ། སྦྱིན་པ་དང་། སྙན་པར་སྨྲ་བ་དང་། དོན་བྱེད་པ་དང་། དོན་འཐུན་པས་བརྩོན་འགྲུས་དང་། སྟོབས་དང་། སྤྲོ་བ་དང་། བློ་དང་། ཕ་རོལ་གནོན་པ་དམ་པ་དེ་ལྟ་བུ་དང་ལྡན་པར་འགྱུར་རོ།
en: “If, when they hear this teaching of the inexhaustible core, those persons immediately cultivate the perfection of diligence, they will be endowed with generosity, pleasant speech, the ability to benefit, diligence that accords with one’s aim, strength, enthusiasm, intelligence, and sacred courage.

source: །ལྷའི་དབང་པོ་དང་། ཀླུའི་དབང་པོ་དང་། གནོད་སྦྱིན་གྱི་དབང་པོ་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་དང་། ནམ་མཁའ་ལྡིང་གི་དབང་པོ་དང་། མི་འམ་ཅིའི་དབང་པོ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་དང་། མིའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་དད་པར་བྱ་བའི་འོས་སུ་གྱུར་པ་ཡིན། མཆོད་པའི་འོས་སུ་གྱུར་པ་དང་། ཕྱག་བྱ་བའི་འོས་སུ་གྱུར་པ་ཡིན། དྲན་པར་བྱ་བའི་འོས་སུ་གྱུར་པ་ཡིན། མངོན་པར་དགའ་བར་བྱ་བའི་འོས་སུ་གྱུར་པ་དང་། རབ་ཏུ་སྲུང་བའི་འོས་སུ་གྱུར་པ་ཡིན་པ་ནས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་བར་དུ་འགྱུར་རོ།
en: They will be worthy to be trusted, worshiped, revered, remembered, pleased, and protected by all the lords of the gods, nāgas, yakṣas, asuras, garuḍas, kinnaras, mahoragas, and humans, [. . .] and they will swiftly awaken to unsurpassed and perfect buddhahood.

source: །སྐྱེས་བུ་དེ་མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་འདི་ཐོས་པ་ཙམ་གྱི་མོད་ལ་གལ་ཏེ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གོམས་པར་བྱེད་ན་དེ་སེམས་ཅན་ཐམས་ཅད་དང་བྲལ་བ་དང་། མི་དམིགས་པ་དང་ལྡན་པ་དང་། འཕགས་པས་བྱིན་གྱིས་བརླབས་པ་དང་། ཆོས་ལ་དམིགས་པའི་བཟོད་པ་དེ་ལྟ་བུ་འཐོབ་པར་འགྱུར་ཏེ།
en: “If, when they hear this teaching of the inexhaustible core, those persons immediately cultivate the perfection of patience, they will be free from all beings, they will be endowed with nonapprehension, they will be blessed by noble beings, and they will achieve the acceptance that focuses on the Dharma.

source: དེས་ཀྱང་དེའི་ཡན་ལག་དང་ཉིང་ལག་དག་ཕྱུང་ཞིང་བཅད་ན་ཡང་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ཀྱང་ཁྲོ་བ་སྐྱེད་པར་མི་འགྱུར་ཞིང་ཁྲོ་བ་ཐམས་ཅད་སྤངས་པར་འགྱུར་རོ།
en: Even if their main and secondary limbs are cut off, not a single instant of anger will arise in them, and they will renounce all forms of aggression.

source: །ལྷའི་དབང་པོ་ཐམས་ཅད་ནས་མིའི་དབང་པོ་ཐམས་ཅད་ཀྱི་བར་གྱིས་དད་པར་བྱ་བའི་འོས་སུ་གྱུར་པ་ནས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་བར་དུ་འགྱུར་རོ།
en: They will be worthy to be trusted by everyone, from the lords of the gods to the lords of the humans, [. . .] and they will swiftly awaken to unsurpassed and perfect buddhahood.

source: །དེ་བཞིན་དུ་སྐྱེས་བུ་དེ་མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་འདི་ཐོས་པ་ཙམ་གྱི་མོད་ལ་གལ་ཏེ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གོམས་པར་བྱེད་ན་མྱུར་དུ་འཕགས་པས་བྱིན་གྱིས་བརླབས་པ་དང་། ཆོས་ལ་དམིགས་པའི་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་དང་། གཟུངས་ཀྱི་སྒོ་དང་། བཟོད་པའི་སྒོ་དེ་ལྟ་བུ་བྱེ་བ་ཕྲག་བརྒྱ་སྟོང་ཐོབ་པར་འགྱུར་རོ།
en: “Similarly, if, when they hear this teaching of the inexhaustible core, those persons immediately cultivate the perfection of concentration, they will be swiftly blessed by noble beings and achieve the concentration that focuses on the Dharma, and they will achieve liberation, and formless attainment, as well as trillions of gateways to absorption, dhāraṇī, and acceptance.

source: །དུས་ཐམས་ཅད་དུ་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་དགོངས་པར་འགྱུར་རོ།
en: They will always be considered by all the buddhas.

source: །དེ་ལྷའི་དབང་པོ་ཐམས་ཅད་ནས་མིའི་དབང་པོ་ཐམས་ཅད་ཀྱི་བར་གྱིས་བསམས་པར་འགྱུར་ཞིང་དད་པར་བྱ་བའི་འོས་སུ་གྱུར་པ་ནས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་བར་དུ་འགྱུར་རོ།
en: Everyone—from the lords of the gods to the lords of the humans—will think about them, and they will deserve their trust. [. . .] They will swiftly awaken to unsurpassed and perfect buddhahood.

source: །རིགས་ཀྱི་བུ་གང་ལ་ལ་མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་ཞེས་བྱ་བ་འདི་ལན་ཅིག་ཙམ་སེམས་རྩེ་གཅིག་པས་ཉན་པར་བྱེད་ན་དེ་ལ་ལྷག་པར་ཡང་དགའ་བ་དང་། དད་པ་དང་། ཉེ་བར་རྟོག་པ་ཀུན་ཏུ་སྐྱེད་པར་བྱེད་དོ།
en: “Noble son, those who listen one pointedly to this teaching of the inexhaustible core even a single time will give rise to intense joy, faith, and comprehension.

source: །དེ་ལས་ཀྱི་སྒྲིབ་པ་དང་། སེམས་ཀྱི་སྒྲིབ་པ་དང་། ཆོས་ཀྱི་སྒྲིབ་པ་དང་། ཉོན་མོངས་པའི་སྒྲིབ་པ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱི་བགེགས་བྱེད་པ། འཕངས་པ། སོ་སོར་མ་རྟེན་པ། མ་ཟད་པ། མ་སྦྱངས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱང་མ་ལུས་པར་ཟད་པར་འགྱུར་ཏེ།
en: All their karmic obscurations, mental obscurations, obscurations to the Dharma, and afflictive obscurations—as numerous as the grains of sand in the Ganges—that cause them to block, discard, and disregard all roots of virtue and prevent their fulfillment and practice will be exhausted.

source: དེ་ལ་འབྲས་བུ་འགྲུབ་པར་མི་འགྱུར་རོ། །མཚམས་མེད་པ་བྱེད་པ་དང་། དམ་པའི་ཆོས་སྤོང་བར་བྱེད་པ་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པར་བྱེད་པའི་ལས་རྣམས་ནི་མ་གཏོགས་སོ།
en: The fruition of these obscurations will not manifest, except for that of the karmic actions generated by the acts of immediate retribution, the rejection of the sacred Dharma, and the denigration of noble beings.

source: །དེ་གང་གི་ཚེ་འཕགས་པ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གོམས་པར་བྱེད་ན་དེ་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་དང་། རང་རྒྱལ་བ་དང་། དགྲ་བཅོམ་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ། །དབེན་པ་ལ་མངོན་པར་དགའ་བར་འགྱུར་རོ།
en: “When they cultivate the perfection of insight of the noble ones, they will be blessed by all buddhas, bodhisattvas, solitary buddhas, and worthy ones, and they will enjoy remaining in seclusion.

source: །གང་དག་གིས་དེ་ལ་འཕགས་པའི་ཤེས་རབ་ཀྱི་དབང་པོ་ལེགས་པར་སྦྱང་བར་བྱས་པ་དང་། ཤིན་ཏུ་མཐར་ཕྱིན་པར་འགྱུར་བའི་ཆོས་དེ་ལྟ་བུ་དག་དེའི་སེམས་དང་སེམས་ལས་བྱུང་བ་དག་གི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: The qualities through which they purify and perfect the faculty of insight of the noble ones will arise within their minds and mental states.

source: །དེ་ཆོས་ཐམས་ཅད་ལ་ཞུགས་པར་འགྱུར་ཞིང་ཐེ་ཙོམ་མེད་པ་དང་ཐེ་ཙོམ་ལས་རྒལ་བར་འགྱུར་རོ།
en: They will comprehend all phenomena and eliminate and transcend all doubts.

source: །ལྷ་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་མི་རྫི་བར་འགྱུར་རོ། །དེ་ལྷའི་དབང་པོ་ཐམས་ཅད་དང་། གནོད་སྦྱིན་གྱི་དབང་པོ་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་དང་། ནམ་མཁའ་ལྡིང་གི་དབང་པོ་དང་། མི་འམ་ཅིའི་དབང་པོ་དང་། མིའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་དད་པར་བྱ་བའི་འོས་སུ་གྱུར་པ་དང་། དྲན་པར་བྱ་བའི་འོས་སུ་གྱུར་པ་དང་། མངོན་པར་དགའ་བར་བྱ་བའི་འོས་སུ་གྱུར་པ་དང་། མཆོད་པ་བྱ་བའི་འོས་སུ་གྱུར་པ་དང་། ཕྱག་བྱ་བའི་འོས་སུ་གྱུར་པ་དང་། རབ་ཏུ་བསྲུང་བའི་འོས་སུ་གྱུར་པ་ཡིན་ནོ།
en: The world with its gods and asuras will not be able to harm them, and they will be worthy to be trusted, remembered, pleased, worshiped, revered, and protected by all the lords of the gods, yakṣas, asuras, garuḍas, kinnaras, and humans.

source: །དེ་ཕྱི་མའི་དུས་ན་འཆི་བའི་ཚེ་ཕྱོགས་བཅུ་ཀུན་ཏུ་གོམས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་མཐོང་བར་འགྱུར་རོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་དེ་ལ་ཕྱག་རྐྱོང་བར་མཛད་ཅིང་དེ་ལ་འདི་སྐད་དུ་སྐྱེས་བུ་དམ་པ་ངེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་ཚུར་ཤོག །དེར་གནས་པར་བྱོས་ཤིག །
en: Later, when they die, in the ten directions they will behold familiar blessed buddhas who will extend them a hand and say, ‘Sacred being, come here and stay in my pure buddha realm.

source: དེར་ངེད་ཀྱིས་རིགས་པས་ས་བཅུ་ལ་གཞག་པར་མཛད་དོ་ཞེས་ཀྱང་གསུང་བར་འགྱུར་རོ།
en: I will establish you on the ten levels by means of knowledge.’

source: །དེ་སངས་རྒྱས་མཐོང་བ་དང་། འཕགས་པའི་དགའ་བ་དང་། དད་པ་དེས་འཆི་བའི་དུས་བྱས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་སྟོང་པ་མ་ཡིན་པ་དེ་དག་ཏུ་སྐྱེ་བར་འགྱུར་རོ།
en: Through their vision of these buddhas, their noble joy, and their faith, they will, after they die, be born into pure buddha realms where buddhas are present.

source: །དེ་དེར་ཡང་ས་བཅུ་འཐོབ་ཅིང་རིང་པོ་མི་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: There they will attain the ten levels, and before long they will awaken to unsurpassed and perfect buddhahood.

source: །རིགས་ཀྱི་བུ་མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ནི་དེ་ལྟར་ཕན་ཡོན་ཆེ་བ་ཡིན་ནོ།
en: Noble son, this is how greatly beneficial the great teaching of the inexhaustible core is.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཐམས་ཅད་ནས་སྨད་ཅིང་བོར་བ་མཚམས་མེད་པ་བྱེད་པ་དང་། དམ་པའི་ཆོས་སྤོང་བ་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་དང་། ལྟུང་བའི་རྩ་བ་བྱུང་བའི་སེམས་ཅན་གང་མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ཐོས་ནས་བྱམས་པའི་སེམས་དང་ལྡན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བའི་སེམས་དང་ལྡན་པ་དང་། མཉམ་པའི་སེམས་དང་ལྡན་པ་དང་། ཕྲ་མ་མི་བྱེད་པའི་སེམས་དང་ལྡན་པ་དང་། ཚིག་ཀྱལ་པ་མི་སྨྲ་བའི་སེམས་དང་ལྡན་པས་ལོ་བདུན་དུ་གནས་པར་བྱེད་ཅིང་རྟག་ཏུ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་སྒོམ་པར་བྱེད་ལ། ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་དུ་ཆོས་གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ནས་པུས་མོའི་ལྷ་ང་གཉི་ག་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་ནས་མངོན་དུ་སངས་རྒྱས་ཡིད་ལ་བྱེད་པས་མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་འདི་དྲན་པར་བྱེད་ན་ལོ་བདུན་འདས་ནས་དེའི་ལས་དྲག་པོ་ཐམས་ཅད་མ་ལུས་པར་ཟད་པར་འགྱུར་ཞིང་སྦྱངས་པར་འགྱུར་ཏེ།
en: “If sentient beings who are despised and rejected from all the pure buddha realms, who have committed the acts of immediate retribution, who have rejected the sacred Dharma, denigrated the noble ones, and committed the root downfalls hear this great teaching of the inexhaustible core, and if, while maintaining for seven years an attitude that is loving, affectionate toward all beings, impartial, and free from slander or idle gossip, they remember it by constantly cultivating the recollection of the Buddha and fixing their attention on him three times during the day and three times during the night while draping their shawls over one shoulder, kneeling on both knees, and joining their palms together, then, after those seven years have passed, the entirety of their terrible karmic actions will be exhausted and purified.

source: རིགས་ཀྱི་བུ་མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ནི་དེ་ལྟར་རྫུ་འཕྲུལ་ཆེ་བ་ཡིན་ནོ།
en: Noble son this great teaching of the inexhaustible core is therefore endowed with great miraculous powers.

source: །འདིར་དབང་ཕྱུག་ལ་མངོན་པར་འདོད་པའི་བུད་མེད་གང་ཞིག་མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་འདི་ཐོས་ནས་ཟླ་བ་བདུན་དུ་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་པུས་མོའི་ལྷ་ང་གཉི་ག་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་ནས་མདུན་དུ་མངོན་དུ་སངས་རྒྱས་ཡིད་ལ་བྱེད་པས་མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་འདི་དྲན་པར་བྱེད་ན་བུད་མེད་དེ་རིས་འཐུན་པར་དབང་ཕྱུག་ཆེན་པོ་ཐོབ་པར་འགྱུར་རོ།
en: “If women who wish for success hear this teaching of the inexhaustible core and remember it while visualizing the Buddha in front of them three times during the day and three times during the night for seven months while kneeling on both knees and joining their palms together, they will achieve great success.

source: །ཕྱིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་རང་གི་སྨོན་ལམ་མ་གཏོགས་པར་འཁོར་བར་བུད་མེད་ཀྱི་དངོས་པོ་འཐོབ་པར་མི་འགྱུར་རོ།
en: From then on, until they reach unsurpassed and perfect awakening, they will no longer be born with a female body in saṃsāra—unless they wish for it.

source: །ཁྱོད་མངོན་པར་འདོད་པའི་བུད་མེད་གང་ཞེས་བྱ་བ་ནས་རིགས་མངོན་པར་འདོད་པའི་བུད་མེད་གང་ཞེས་བྱ་བའི་བར་དང་། ནོར་མངོན་པར་འདོད་པའི་བུད་མེད་གང་ཞེས་བྱ་བའི་བར་དང་། མངལ་ན་བུ་ཡོད་པའི་ཁུར་གྱིས་སྐྱོ་བའི་བུད་མེད་གང་ཞེས་བྱ་བའི་བར་དང་། བུ་མངོན་པར་འདོད་པའི་བུད་མེད་གང་ཞེས་བྱ་བའི་བར་དེ་ཁྲུས་བྱས་ནས་བྱི་འཆོར་པ་སྲུང་བར་བྱེད་ཅིང་ཉིན་ལན་གསུམ་དབེན་པར། མཚན་ལན་གསུམ་དབེན་པར་པུས་མོའི་ལྷ་ང་གཉི་ག་ས་ལ་བཙུགས་ཏེ་ཐལ་མོ་སྦྱར་བ་རབ་ཏུ་བཏུད་ནས་མདུན་དུ་མངོན་དུ་སངས་རྒྱས་ཡིད་ལ་བྱེད་པས་མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་ཆེན་པོ་འདི་དྲན་པར་བྱེད་ན་བུད་མེད་དེ་བུ་ཇི་ལྟ་བུ་འདོད་པ་དེ་ལྟ་བུ་འབྱུང་བར་འགྱུར་རོ།
en: If women who wish for a husband, for status, for wealth, for pregnancy, or for sons perform ablutions, guard against frivolousness, and remember this great teaching of the inexhaustible core by visualizing the Buddha in front of them three times during the day and three times during the night in a solitary place while kneeling on both knees and bowing with their palms joined together, their wishes will then be fulfilled accordingly.

source: །བླ་ན་མེད་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བར་དུ་ཡང་རང་གི་སྨོན་ལམ་མ་གཏོགས་པར་དེའི་བུད་མེད་འཐོབ་པའི་ཐ་མ་ཡིན་ནོ། །མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ནི་དེ་ལྟར་དོན་ཆེ་བ་དེ་ལྟར་ཕན་ཡོན་ཆེ་བ་སྟེ་ཁྱེད་ཀྱིས་སྔོན་མ་ཐོས་པ་ཡིན་ནོ། །
en: Until they reach unsurpassed nirvāṇa, it will be the last time they are born with a female body—unless they wish for it. This great teaching of the inexhaustible core is therefore very meaningful and beneficial; you have never heard anything like this before!

source: ཏད་ཡ་ཐཱ། ཤ་ར་ཎ་བྱ་ཡ། ཤིཀྵ་བྱ་ཡ། སྨྲྀཏི་བྱ་ཡ། བྲ་ཧྨ་ཎི་བྱ་ཡ། རྀདྡྷིབྱ་ཡ། ཨིནྡྲཱི་ཡ་བྱ་ཡ། བ་ལ་བྱ་ཡ། བོ་དྷྱངྒ་བྱ་ཡ། ས་མཱ་དྷི་བྱ་ཡ། དྷཱ་ར་ཎཱི་བྱ་ཡ། ཀྵཱན་ཏི་བྱ་ཡ། བྷྱ་ན་བྱ་ཡ། ཨ་རཱུ་པ་བྱ་ཡ། ཨ་ནི་ན་ཛ་བྱ་ཡ། མཱརྒ་བྱ་ཡ། ཨ་བི་ཛྙཱ་བྱ་ཡ། པྲ་ཏི་ས་མ་བིད་བྱ་ཡ། བྷཱུ་མི་བྱ་ཡ། བིདྱཱ་བྱ་ཡ། མ་ཧཱ་མཻ་ཏྲི་བྱ་ཡ། མ་ཧཱ་ཀཱ་རུ་ཎཱ་བྱ་ཡ། པྲཱི་ཐྭཱི་བྱ་ཡ། ས་ཏྭ་བྱ་ཡ། དྷ་རྨ་བྱ་ཡ། ཏ་མོ་བྱ་ཡ། ཨ་ལོ་ཀ་བྱ་ཡ། པྲ་ཏི་བྷ་ས་བྱ་ཡ། པྲ་ཏི་ཤྲུད་ཀ་བྱ་ཡ། ག་ག་ན་བྱ་ཡ། མ་རུ་ཏ་བྱ་ཡ། ཤཱུ་ནྱ་ཏཱ་བྱ་ཡ། པྲ་ཎི་ཧི་ཏ་བྱ་ཡ། ཨ་ནི་མིཏྟ་བྱ་ཡ། རུ་ཏ་བྱ་ཡ། གྷོ་ཥ་བྱ་ཡ། ཀིན་ཙ་ནཱ་བྱ་ཡ། ཨ་བྷི་ས་མ་ཡ་ཨ་ནཱུ་ན། ཨ་པ་ཧ། ཙ་ཙ་ཙ་ཙ། ཙཱ་རཱ་ཙ། ཙ་ར་བི་མུ། ཙ་བི་ཙཀྵ་ཙ། ཀུ་ཙ་ཙཱ་ར་བི་མུ། བྱ་ཡ་བི་མུ། ཀྵ་ཡ་བི་མུ། ཨ་ས་མུ་དྲ། ཙ་ར་བི་མུ། ཙྪ་ད་བི་མུ། ཨཱ་ཀཱ་ཤ་བི་མུ། བྱུ་པ་ཤ་མ་བི་མུ། ཨ་ནཱ་བྷ་ས་བི་མུ། ཨ་ཧ་ཏ་བི་མུ། ཨཱ་ར་པཱ་ར་བི་མུ། ཨ་ར་པ་ར་བི་མུ། ཨུ་པ་ཤ་མ་ས་ལི་ལ་བི་མུ་སྭཱ་ཧཱ།
en: tadyathā: śaraṇavyaya śikṣavyaya smṛtivyaya brahmaṇivyaya ṛddhivyaya indrīyavyaya balavyaya bodhyaṅavyaya samādhivyaya dhāraṇīvyaya kṣāntivyaya dhyānavyaya arūpavyaya aninajavyaya mārgavyaya avijñāvyaya pratisamavidvyaya bhūmivyaya vidyāvyaya āmaitrivyaya mahākāruṇāvyaya pṛthavivyaya satvavyaya dharmavyaya tamovyaya ālokavyaya pratibhasavyaya pratiśrudkavyaya gaganavyaya marutavyaya śunyatāvyaya praṇihitavyaya animittavyaya rutavyaya ghoṣavyaya kincanāvyaya abhisamaya anūna apaha cacacaca cārāca caravimu cavicakṣaca kucacāravimu vyayavimu kṣayavimu caravimu cavicakṣaca kucacāravimu vyayavimu kṣayavimu asamudra caravimu cchadavimu ākāśavimu vyupaśamavimu anābhasavimu ahatavimu ārapāravimu araparavimu upaśamasalilavimu svāhā.

source: རིགས་ཀྱི་བུ་མི་ཟད་པའི་སྦུབས་ལུང་བསྟན་པ་ཆེན་པོ་དེ་ནི་འདི་ཡིན་ཏེ།
en: “Noble son, this is the great teaching of the inexhaustible core.

source: ཡོན་ཏན་ཆེ་བ། དོན་ཆེ་བ། ཕན་ཡོན་ཆེ་བ།
en: It is endowed with great qualities, great meaning, and great benefits.

source: སེམས་ཅན་ཐམས་ཅད་དབང་དུ་བྱེད་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བྱེད་པ། སེམས་ཅན་ཐམས་ཅད་འཁྲུ་བར་བྱེད་པ། སྣང་བར་བྱེད་པ། ཉེ་བར་ཞི་བར་བྱེད་པ་ཡིན་ནོ།
en: It subjugates all sentient beings and benefits, cleanses, illuminates, and pacifies all of them.

source: །ལོང་ལ་ངའི་བཀས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་ཞུ་བའི་ཕྱིར་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སོང་ཤིག །དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ངོ་མཚར་ཐོབ་ཅིང་ཤིན་ཏུ་དགའ་བ་ཐོབ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྒྲིབ་པ་མི་མངའ་བའི་ཡེ་ཤེས་གཟིགས་པ་དང་།
en: Arise, and go to the Sahā world to present my words to the thus-gone Śākyamuni!” Then, amazed and filled with intense joy, the entire retinue exclaimed, “The unobscured wisdom vision of the blessed buddhas is amazing, and so is this great teaching taught by the Thus-Gone One!

source: ལུང་བསྟན་པ་གང་གིས་སེམས་ཅན་རྣམས་ཀྱི་ལས་ཀྱི་སྒྲིབ་པ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལ་བགེགས་བགྱིད་པ་ཆུང་ངུ་དང་། འབྲིང་དང་། ཆེན་པོ་སྲ་བ་དག་མ་ལུས་པར་བས་པར་འགྱུར་ཞིང་མྱུར་དུ་བྱང་གྲོལ་གྱི་བདེ་བ་ཡང་རྗེས་སུ་འཐོབ་པར་འགྱུར་བའི་ལུང་བསྟན་པ་ཆེན་པོ་དེ་ལྟ་བུ་དེ་བཞིན་གཤེགས་པས་བསྟན་པ་ནི་ངོ་མཚར་ལགས་སོ།
en: It eliminates all minor, middling, and severe karmic obscurations that hinder all roots of virtue, and it swiftly delivers the happiness of emancipation!”

source: །དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སྤོས་ཀྱི་གླང་པོ་ཆེས་ཆེད་དུ་བརྗོད་པ་འདི་ཆེད་དུ་བརྗོད་དོ།
en: Then, the bodhisattva Gandhahastin exclaimed:
